zephyrproject-rtos/hal_nxp/dts/nxp/lpc/lpc54xxx/pinctrl/LPC54114J256BD64-pinctrl.h
#define DMA0_TRIG14_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG15_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG16_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG17_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG18_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG19_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG4_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG5_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG7_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG8_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define DMA0_TRIG9_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define FC7_TXD_SCL_MISO_WS_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 2) /* PIO1_8 */
#define GPIO_PIO18_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT0_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT1_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT2_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT3_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT4_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT5_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT6_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define PINT_PINT7_PIO1_8 IOCON_MUX(40, IOCON_TYPE_D, 0) /* PIO1_8 */
#define ADC0_TRIG0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define ADC0_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define CTIMER0_CAPTURE2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 3) /* PIO1_9 */
#define DMA0_TRIG0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG10_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG11_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG12_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG13_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG14_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG15_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG16_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG17_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG18_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG5_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG6_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG7_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG8_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define DMA0_TRIG9_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define FC3_RXD_SDA_MOSI_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 2) /* PIO1_9 */
#define GPIO_PIO19_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT0_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT1_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT2_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT3_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT4_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT5_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT6_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define PINT_PINT7_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 0) /* PIO1_9 */
#define USB0_UP_LED_PIO1_9 IOCON_MUX(41, IOCON_TYPE_D, 6) /* PIO1_9 */
#define ADC0_TRIG0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define ADC0_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG10_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG11_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG12_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG13_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG14_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG15_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG16_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG17_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG18_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG19_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG5_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG6_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG7_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG8_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define DMA0_TRIG9_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define FC1_SCK_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 4) /* PIO1_10 */
#define FC6_TXD_SCL_MISO_WS_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 2) /* PIO1_10 */
#define GPIO_PIO110_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT0_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT1_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT2_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT3_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT5_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT6_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define PINT_PINT7_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 0) /* PIO1_10 */
#define SCT0_OUT4_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 3) /* PIO1_10 */
#define USB0_FRAME_PIO1_10 IOCON_MUX(42, IOCON_TYPE_D, 7) /* PIO1_10 */
#define ADC0_TRIG0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define ADC0_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define CTIMER1_CAPTURE0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 3) /* PIO1_11 */
#define DMA0_TRIG0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG10_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG11_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG12_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG13_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG14_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG15_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG16_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG17_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG18_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG19_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG4_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG5_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG6_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG7_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG8_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define DMA0_TRIG9_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define FC4_SCK_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 4) /* PIO1_11 */
#define FC6_RTS_SCL_SSEL1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 2) /* PIO1_11 */
#define GPIO_PIO111_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT0_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT1_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT2_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT3_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT4_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT5_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT6_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define PINT_PINT7_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 0) /* PIO1_11 */
#define USB0_VBUS_PIO1_11 IOCON_MUX(43, IOCON_TYPE_D, 7) /* PIO1_11 */
#define ADC0_TRIG0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define ADC0_TRIG1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define CTIMER1_MATCH0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 3) /* PIO1_12 */
#define DMA0_TRIG0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG10_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG11_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG12_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG13_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG14_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG15_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG16_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG17_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG18_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG19_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG3_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG4_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG5_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG6_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG7_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG8_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define DMA0_TRIG9_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define FC5_RXD_SDA_MOSI_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 2) /* PIO1_12 */
#define FC7_SCK_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 4) /* PIO1_12 */
#define GPIO_PIO112_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT0_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT1_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT3_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT4_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT5_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT6_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define PINT_PINT7_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 0) /* PIO1_12 */
#define UTICK0_CAPTURE2_PIO1_12 IOCON_MUX(44, IOCON_TYPE_D, 5) /* PIO1_12 */
#define ADC0_TRIG0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define ADC0_TRIG1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define CTIMER1_MATCH1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 3) /* PIO1_13 */
#define DMA0_TRIG0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG10_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG11_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG12_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG13_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG14_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG15_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG16_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG17_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG18_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG19_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG4_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG5_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG6_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG7_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG8_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define DMA0_TRIG9_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define FC5_TXD_SCL_MISO_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 2) /* PIO1_13 */
#define FC7_RXD_SDA_MOSI_DATA_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 4) /* PIO1_13 */
#define GPIO_PIO113_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT0_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT1_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT2_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT3_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT4_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT5_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT6_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define PINT_PINT7_PIO1_13 IOCON_MUX(45, IOCON_TYPE_D, 0) /* PIO1_13 */
#define ADC0_TRIG0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define ADC0_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG10_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG11_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG12_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG13_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG14_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG15_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG16_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG17_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG18_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG19_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG5_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG6_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG8_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define DMA0_TRIG9_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define FC2_RXD_SDA_MOSI_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 2) /* PIO1_14 */
#define FC7_TXD_SCL_MISO_WS_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 4) /* PIO1_14 */
#define GPIO_PIO114_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT0_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT1_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT2_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT3_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT4_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT5_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT6_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define PINT_PINT7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 0) /* PIO1_14 */
#define SCT0_OUT7_PIO1_14 IOCON_MUX(46, IOCON_TYPE_D, 3) /* PIO1_14 */
#define ADC0_TRIG0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define ADC0_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define CTIMER1_CAPTURE3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 3) /* PIO1_15 */
#define DMA0_TRIG0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG10_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG11_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG12_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG13_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG14_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG15_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG16_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG17_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG18_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG19_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG8_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMA0_TRIG9_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define DMIC0_CLK0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 1) /* PIO1_15 */
#define FC7_CTS_SDA_SSEL0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 4) /* PIO1_15 */
#define GPIO_PIO115_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT0_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT1_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT2_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT3_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT4_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT6_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define PINT_PINT7_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 0) /* PIO1_15 */
#define SCT0_OUT5_PIO1_15 IOCON_MUX(47, IOCON_TYPE_D, 2) /* PIO1_15 */
#define ADC0_TRIG0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define CTIMER0_CAPTURE0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 3) /* PIO1_16 */
#define CTIMER0_MATCH0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 2) /* PIO1_16 */
#define DMA0_TRIG0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG10_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG11_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG12_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG13_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG14_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG15_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG16_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG17_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG18_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG19_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG5_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG6_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG8_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMA0_TRIG9_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define DMIC0_DATA0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 1) /* PIO1_16 */
#define FC7_RTS_SCL_SSEL1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 4) /* PIO1_16 */
#define GPIO_PIO116_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT0_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT1_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT2_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT3_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT4_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT5_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT6_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define PINT_PINT7_PIO1_16 IOCON_MUX(48, IOCON_TYPE_D, 0) /* PIO1_16 */
#define ADC0_TRIG0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define ADC0_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG10_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG11_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG12_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG13_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG14_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG15_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG16_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG17_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG18_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG19_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG5_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG6_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG7_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG8_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define DMA0_TRIG9_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define GPIO_PIO117_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define MCLK_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 4) /* PIO1_17 */
#define PINT_PINT0_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT1_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT2_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT4_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT5_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT6_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define PINT_PINT7_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 0) /* PIO1_17 */
#define UTICK0_CAPTURE3_PIO1_17 IOCON_MUX(49, IOCON_TYPE_D, 5) /* PIO1_17 */

#endif
